"""
Задание 1.

Поработайте с переменными, создайте несколько,
выведите на экран, запросите у пользователя несколько чисел и
строк и сохраните в переменные, выведите на экран.
"""

name = input("Введите Ваше имя: ")
pwd = input("Введите Ваш пароль: ")
age = input("Введите Ваш возраст: ")

print(f"Ваши данные для входа в аккаунт: имя - {name}, пароль - {pwd}, возраст - {age}")
